templates/getClientDetails00002-request.xml.erb

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://services.acuritywebservices.finsyn.com.au/">
   <soapenv:Header/>
   <soapenv:Body>
      <ser:getClientDetails00002>
        <endUser><%= end_user %></endUser>
        <SBz_Client><%= client_number %></SBz_Client>
      </ser:getClientDetails00002>
   </soapenv:Body>
</soapenv:Envelope>